{
    "name": "SDLReader",
    "version": "v2.1.3",
    "type": "TOOL",
    "description": "Read PDF, CBZ/ZIP & CBR/RAR comic archives, EPUB, and MOBI e-books with smooth navigation, zoom, rotation, and mirroring. SDLReader is a lightweight, cross-platform viewer optimized for the TrimUI Brick and TrimUI Smart Pro (TG5040) running NextUI, built on SDL2 and MuPDF.",
    "author": "Helaas",
    "repo_url": "https://github.com/Helaas/SDLReader-brick",
    "release_filename": "SDLReader.pak.zip",
    "changelog": {
        "v2.1.3": "File browser letter-jump navigation (L1 + R1) and add support for tapping left & right to scroll a full page in list view.",
        "v2.1.2": "Enable reading RAR5 archives and add full TrimUI Smart Pro support.",
        "v2.1.1": "Prevent the thumbnail viewer from crashing when handling large folders.",
        "v2.1.0": "Settings persist after app updates, configurable document minimap, thumbnails in file browser (X button), smoother high-zoom rendering, improved controller-friendly menus, and more robust TG5040 power handling.",
        "v2.0.1": "UI improvements with smart text contrast, continuous D-pad scrolling in file browser, and edge progress bar can now be disabled.",
        "v2.0.0": "Major rework with ImGui UI overlay, controller-ready file browser, runtime font & theme picker, reading history, and expanded TG5040 bundle tooling.",
        "v1.1.0": "Support for WebP images in CBZ/CBR archives and EPUB/MOBI files, improving compatibility with modern comics and e-books.",
        "v1.0.3": "Adds support for CBR (RAR) comic book archives ",
        "v1.0.2": "Fixed zoom/pan lag and high-zoom slowdowns with better prerendering, caching, and rendering limits.",
        "v1.0.1": "Better scrolling, support for MOBI files [MuPDF 0.50 -> 1.26.7], and faster performance by streamlining the code.",
        "v1.0.0": "Initial release with PDF, CBZ, and EPUB support, optimized for TrimUI Brick"
    },
    "screenshots": [
        ".github/resources/tg5040%20controls.png",
        ".github/resources/smart%20pro%20controls.png",
        ".github/resources/Screenshot.2025-11-15-20-37-26.png",
        ".github/resources/Screenshot.2025-11-15-23-27-12.png",
        ".github/resources/Screenshot.2025-11-15-23-27-17.png",
        ".github/resources/Screenshot.2025-11-15-23-40-52.png"
    ],
    "platforms": [
        "tg5040"
    ]
}
